In [192]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [193]:
# print the head of the data
purchase_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [54]:
number_of_player = purchase_data['SN'].value_counts()

In [56]:
len(number_of_player)

576

In [59]:
number_of_players = pd.DataFrame({ "Total player" : [len(number_of_player)]})

In [60]:
number_of_players

   Total player
0           576

## Purchasing Analysis (Total)

In [34]:
number_unique_item = len(purchase_data['Item ID'].value_counts())

In [35]:
number_unique_item

179

In [36]:
average_price = purchase_data['Price'].mean()

In [37]:
average_price

3.050987179487176

In [42]:
Number_of_Purchases = purchase_data["Purchase ID"].count()

In [43]:
Number_of_Purchases

780

In [194]:
#Calc fo the total revenue
total_revenue = purchase_data['Price'].sum()

In [45]:
total_revenue

2379.77

In [46]:
summary_data_frame = pd.DataFrame({
    "Number of Unique Items" : [number_unique_item],
    "Average Price" :[average_price],
    "Number of Purchases" : [Number_of_Purchases],
    "Total Revenue" : [total_revenue]
})

In [47]:
## display the summary of the dataFrame
summary_data_frame

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [63]:
male = purchase_data[purchase_data['Gender'] == 'Male']['SN'].value_counts()

In [65]:
len(male)

484

In [71]:
female = purchase_data[purchase_data['Gender'] == 'Female']['SN'].value_counts()

In [72]:
len(female)

81

In [73]:
others = purchase_data[purchase_data['Gender'] == 'Other / Non-Disclosed']['SN'].value_counts()

In [74]:
len(others)

11

In [77]:
male_percentage = 484 * 100 / 576

In [78]:
male_percentage

84.02777777777777

In [79]:
female_percentage = 81 * 100 / 576

In [80]:
female_percentage

14.0625

In [81]:
others_percentage = 11 * 100 /576

In [82]:
others_percentage

1.9097222222222223

In [84]:
dict = {'gender ': ['Male', 'Female', 'Other / Non-Disclosed'],
        'Total Count' : [484, 81, 11],
        'Percentage of Players' : [84, 14.0625, 1.909]}
df = pd.DataFrame(dict)

In [230]:
df

                 gender   Total Count  Percentage of Players
0                   Male          484                84.0000
1                 Female           81                14.0625
2  Other / Non-Disclosed           11                 1.9090

In [88]:
purshase_male = purchase_data[purchase_data['Gender'] == 'Male']['Item ID'].count()

In [89]:
purshase_male

652

In [92]:
purshase_female = purchase_data[purchase_data['Gender'] == 'Female']['Item ID'].count()

In [93]:
purshase_female

113

In [94]:
purshase_others = purchase_data[purchase_data['Gender'] == 'Other / Non-Disclosed']['Item ID'].count()

In [95]:
purshase_others

15

In [96]:
average_price_male = purchase_data[purchase_data['Gender'] == 'Male']['Price'].mean()

In [97]:
average_price_male

3.0178527607361953

In [98]:
average_price_female = purchase_data[purchase_data['Gender'] == 'Female']['Price'].mean()

In [99]:
average_price_female

3.203008849557519

In [100]:
average_price_others = purchase_data[purchase_data['Gender'] == 'Other / Non-Disclosed']['Price'].mean()

In [101]:
average_price_others

3.3460000000000005

In [102]:
total_value_male = purchase_data[purchase_data['Gender'] == 'Male']['Price'].sum()

In [103]:
total_value_male

1967.64

In [104]:
total_value_female = purchase_data[purchase_data['Gender'] == 'Female']['Price'].sum()

In [105]:
total_value_female

361.94

In [106]:
total_value_others = purchase_data[purchase_data['Gender'] == 'Other / Non-Disclosed']['Price'].sum()

In [107]:
total_value_others

50.19

In [108]:
avg_total_value_male = total_value_male / len(male)

In [109]:
avg_total_value_male

4.065371900826446

In [110]:
avg_total_value_female = total_value_female / len(female)

In [111]:
avg_total_value_female

4.468395061728395

In [112]:
avg_total_others = total_value_others / len(others)

In [113]:
avg_total_others

4.5627272727272725

In [116]:
Purshasing_analytique_gender = pd.DataFrame({
    "Gender" : ["Male", "Female", "Other / Non-Disclosed"],
    "Purchase Count" : [purshase_male, purshase_female, purshase_others],
    "Average Purchase Price" :[average_price_male, average_price_female, average_price_others],
    "Total Purchase Value" : [total_value_male, total_value_female, total_value_others],
    "Avg Total Purchase per Person" : [avg_total_value_male, avg_total_value_female, avg_total_others]
})

In [225]:
Purshasing_analytique_gender

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,Male,652,3.017853,1967.64,4.065372
1,Female,113,3.203009,361.94,4.468395
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Top spenders

In [209]:
# Group purchase data by screen names
spender_stats = purchase_data.groupby("SN")

In [211]:
# Count the total purchases by name
purchase_count_spender = spender_stats["Purchase ID"].count()

In [216]:
purchase_count_spender()

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [217]:
# Calculate the average purchase by name 
avg_purchase_price_spender = spender_stats["Price"].mean()

In [218]:
avg_purchase_price_spender

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

 most_prifitable_item = pd.DataFrame({})

In [219]:
# Calculate purchase total 
purchase_total_spender = spender_stats["Price"].sum()

# Create data frame with obtained values
top_spenders = pd.DataFrame({"Purchase Count": purchase_count_spender,
                             "Average Purchase Price": avg_purchase_price_spender,
                             "Total Purchase Value":purchase_total_spender})

In [220]:
top_spenders

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [221]:
# Sort in descending order to obtain top 5 spender names 
best_spenders = top_spenders.sort_values(["Total Purchase Value"], ascending=False).head()

In [222]:
best_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

In [181]:
popular_item = purchase_data['Item ID'].value_counts()

In [162]:
popular_item.head(5)

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

In [183]:
popular_item.head(5)

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

In [189]:
most_popular_item = pd.DataFrame({
    "Item ID" : [92,178,108,132,82], 
    "Item Name" :['Final Critic', 'Oathbreaker Last Hope of the Breaking Storm', 'Nirvana', 'Fiery Glass Crusader', 'Singed Scalpel'],
    "Purshase Count":[13,12,9,9,9],
    "Item Price":[4.61, 4.23, 4.90, 4.58, 4.35],
    "Total value purshase" : [59.99, 50.76, 44.10, 41.22, 34.80]
})

In [190]:
most_popular_item

,Item ID,Item Name,Purshase Count,Item Price,Total value purshase
0,92,Final Critic,13,4.61,59.99
1,178,Oathbreaker Last Hope of the Breaking Storm,12,4.23,50.76
2,108,Nirvana,9,4.90,44.10
3,132,Fiery Glass Crusader,9,4.58,41.22
4,82,Singed Scalpel,9,4.35,34.80

## Most Profitable Items

In [196]:
most_profitable_item = most_popular_item.sort_values(["Total value purshase"],
                                                   ascending=False).head()

In [197]:
most_profitable_item

,Item ID,Item Name,Purshase Count,Item Price,Total value purshase
0,92,Final Critic,13,4.61,59.99
1,178,Oathbreaker Last Hope of the Breaking Storm,12,4.23,50.76
2,108,Nirvana,9,4.90,44.10
3,132,Fiery Glass Crusader,9,4.58,41.22
4,82,Singed Scalpel,9,4.35,34.80

## Age Demographics

In [198]:
# Establish bins for ages
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [200]:
# make Segments and sort age values into bins established above
purchase_data["Age Group"] = pd.cut(purchase_data["Age"],age_bins, labels=group_names)
purchase_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [203]:
# Create new data frame with the added "Age Group" and group it
age_grouped = purchase_data.groupby("Age Group")

# Count total players by age category
total_count_age = age_grouped["SN"].nunique()

# Calculate percentages by age category 
percentage_by_age = (total_count_age/576) * 100

# Create data frame with obtained values
age_demographics = pd.DataFrame({"Percentage of Players": percentage_by_age, "Total Count": total_count_age})

In [204]:
# Format the data frame with no index name in the corner
age_demographics.index.name = None

In [205]:
age_demographics

       Percentage of Players  Total Count
<10                 2.951389           17
10-14               3.819444           22
15-19              18.576389          107
20-24              44.791667          258
25-29              13.368056           77
30-34               9.027778           52
35-39               5.381944           31
40+                 2.083333           12

## Purchasing Analysis (Age)

In [206]:
# Count purchases by age group
purchase_count_age = age_grouped["Purchase ID"].count()

# Obtain average purchase price by age group 
avg_purchase_price_age = age_grouped["Price"].mean()

# Calculate total purchase value by age group 
total_purchase_value = age_grouped["Price"].sum()

# Calculate the average purchase per person in the age group 
avg_purchase_per_person_age = total_purchase_value/total_count_age

In [207]:
# Create data frame with obtained values
age_demographics = pd.DataFrame({"Purchase Count": purchase_count_age,
                                 "Average Purchase Price": avg_purchase_price_age,
                                 "Total Purchase Value":total_purchase_value,
                                 "Average Purchase Total per Person": avg_purchase_per_person_age})

# Format the data frame with no index name in the corner
age_demographics.index.name = None

In [208]:
age_demographics

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667